{"keras_version": "1.0.5", "optimizer": {"epsilon": 1e-08, "lr": 1.0, "name": "Adadelta", "rho": 0.95}, "config": [{"config": {"nb_col": 3, "W_regularizer": null, "input_dtype": "float32", "trainable": true, "subsample": [1, 1], "dim_ordering": "th", "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "b_regularizer": null, "bias": true, "nb_row": 3, "name": "convolution2d_1", "nb_filter": 32, "init": "glorot_uniform", "batch_input_shape": [null, 1, 28, 28], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"nb_col": 3, "W_regularizer": null, "trainable": true, "dim_ordering": "th", "subsample": [1, 1], "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "b_regularizer": null, "bias": true, "nb_row": 3, "name": "convolution2d_2", "nb_filter": 32, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "maxpooling2d_1", "dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "input_dim": null, "bias": true, "name": "dense_1", "output_dim": 128, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "input_dim": null, "bias": true, "name": "dense_2", "output_dim": 10, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "softmax"}, "class_name": "Activation"}], "sample_weight_mode": null, "loss": "categorical_crossentropy", "class_name": "Sequential"}