{"keras_version": "1.0.5", "sample_weight_mode": null, "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_filter": 32, "nb_col": 3, "input_dtype": "float32", "trainable": true, "dim_ordering": "th", "nb_row": 3, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "b_constraint": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 1, 28, 28], "name": "convolution2d_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_filter": 32, "nb_col": 3, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_row": 3, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "b_constraint": null, "W_regularizer": null, "activation": "linear", "name": "convolution2d_2"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "th", "border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "b_constraint": null, "b_regularizer": null, "output_dim": 128, "bias": true, "W_regularizer": null, "activation": "linear", "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "b_constraint": null, "b_regularizer": null, "output_dim": 10, "bias": true, "W_regularizer": null, "activation": "linear", "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_3"}}], "loss": "categorical_crossentropy", "optimizer": {"rho": 0.95, "lr": 1.0, "epsilon": 1e-08, "name": "Adadelta"}}