{"sample_weight_mode": null, "optimizer": {"lr": 1.0, "rho": 0.95, "epsilon": 1e-08, "name": "Adadelta"}, "config": [{"config": {"batch_input_shape": [null, 1, 28, 28], "subsample": [1, 1], "nb_row": 3, "name": "convolution2d_1", "activity_regularizer": null, "nb_filter": 32, "W_constraint": null, "border_mode": "valid", "bias": true, "W_regularizer": null, "dim_ordering": "th", "b_regularizer": null, "activation": "linear", "input_dtype": "float32", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"subsample": [1, 1], "nb_row": 3, "name": "convolution2d_2", "activity_regularizer": null, "nb_filter": 32, "W_constraint": null, "border_mode": "valid", "bias": true, "W_regularizer": null, "dim_ordering": "th", "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "trainable": true, "dim_ordering": "th", "name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.1}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"input_dim": null, "name": "dense_1", "activity_regularizer": null, "output_dim": 128, "W_constraint": null, "bias": true, "trainable": true, "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.1}, "class_name": "Dropout"}, {"config": {"input_dim": null, "name": "dense_2", "activity_regularizer": null, "output_dim": 10, "W_constraint": null, "bias": true, "trainable": true, "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}], "keras_version": "1.0.5", "class_name": "Sequential", "loss": "categorical_crossentropy"}